Repository: pgjdbc/pgjdbc
Catalog: src/main/java/legacy/org/postgresql/translation/*.po
Languages: cs

source: Error loading default settings from driverconfig.properties
cs: Chyba naèítání standardního nastavení z driverconfig.properties

source: Something unusual has occured to cause the driver to fail. Please report this exception.
cs: Nìco neobvyklého pøinutilo ovladaè selhat. Prosím nahlaste tuto vyjímku.

source: Method {0} is not yet implemented.
cs: Metoda {0} není implementována.

source: A connection could not be made using the requested protocol {0}.
cs: Spojení nelze vytvoøit s pou¾itím ¾ádaného protokolu {0}.

source: The driver does not support SSL.
cs: Ovladaè nepodporuje SSL.

source: Connection refused. Check that the hostname and port are correct and that the postmaster is accepting TCP/IP connections.
cs: Spojení odmítnuto. Zkontrolujte zda je jméno hosta a port správné a zda postmaster pøijímá TCP/IP spojení.

source: The connection attempt failed.
cs: Pokus o pøipojení selhal.

source: The server does not support SSL.
cs: Server nepodporuje SSL.

source: An error occured while setting up the SSL connection.
cs: Nastala chyba pøi nastavení SSL spojení.

source: Connection rejected: {0}.
cs: Spojení odmítnuto: {0}.

source: The server requested password-based authentication, but no password was provided.
cs: Server vy¾aduje ovìøení heslem, ale ¾ádné nebylo posláno.

source: The authentication type {0} is not supported. Check that you have configured the pg_hba.conf file to include the client''s IP address or subnet, and that it is using an authentication scheme supported by the driver.
cs: Ovìøení typu {0} není podporováno. Zkontrolujte zda konfiguraèní soubor pg_hba.conf obsahuje klientskou IP adresu èi podsí» a zda je pou¾ité ovìøenovací schéma podporováno ovladaèem.

source: Protocol error. Session setup failed.
cs: Chyba protokolu. Nastavení relace selhalo.

source: Backend start-up failed: {0}.
cs: Selhal start backendu: {0}.

source: An unexpected result was returned by a query.
cs: Obdr¾en neoèekávaný výsledek dotazu.

source: The column index is out of range: {0}, number of columns: {1}.
cs: Index sloupece je mimo rozsah: {0}, poèet sloupcù: {1}.

source: No value specified for parameter {0}.
cs: Nespecifikována hodnota parametru {0}.

source: Expected command status BEGIN, got {0}.
cs: Oèekáván pøíkaz BEGIN, obdr¾en {0}.

source: Unexpected command status: {0}.
cs: Neoèekávaný stav pøíkazu: {0}.

source: An I/O error occured while sending to the backend.
cs: Vystupnì/výstupní chyba pøi odesílání k backend.

source: Unknown Response Type {0}.
cs: Neznámý typ odpovìdi {0}.

source: The driver currently does not support COPY operations.
cs: Ovladaè nyní nepodporuje pøíkaz COPY.

source: DataSource has been closed.
cs: DataSource byl uzavøen.

source: This PooledConnection has already been closed.
cs: Tento PooledConnection byl uzavøen.

source: Connection has been closed.
cs: Spojeni bylo uzavøeno.

source: Statement has been closed.
cs: Statement byl uzavøen.

source: The array index is out of range: {0}
cs: Index pole mimo rozsah: {0}

source: Multi-dimensional arrays are currently not supported.
cs: Více-rozmìrné pole nejsou nyní podporovány.

source: The array index is out of range: {0}, number of elements: {1}.
cs: Index pole mimo rozsah: {0}, poèet prvkù: {1}.

source: LOB positioning offsets start at 1.
cs: Zaèátek pozicování LOB zaèína na 1.

source: No results were returned by the query.
cs: Neobdr¾en ¾ádný výsledek dotazu.

source: A result was returned when none was expected.
cs: Obdr¾en výsledek, ikdy¾ ¾ádný nebyl oèekáván.

source: Failed to create object for: {0}.
cs: Selhalo vytvoøení objektu: {0}.

source: Unable to load the class {0} responsible for the datatype {1}
cs: Nemohu naèíst tøídu {0} odpovìdnou za typ {1}

source: Unable to translate data into the desired encoding.
cs: Nemohu pøelo¾it data do po¾adovaného kódování.

source: Unable to find name datatype in the system catalogs.
cs: Nemohu najít název typu v systémovém katalogu.

source: Unexpected error while decoding character data from a large object.
cs: Neoèekávaná chyba bìham dekódování znaku z velkého objektu.

source: Can''t use relative move methods while on the insert row.
cs: Nemù¾ete pou¾ívat relativní pøesuny pøi vkládání øádku.

source: Invalid fetch direction constant: {0}.
cs: ©patný smìr ètení: {0}.

source: Cannot call cancelRowUpdates() when on the insert row.
cs: Nemù¾ete volat cancelRowUpdates() pøi vkládání øádku.

source: Cannot call deleteRow() when on the insert row.
cs: Nemù¾ete volat deleteRow() pøi vkládání øádku.

source: Currently positioned after the end of the ResultSet. You cannot call deleteRow() here.
cs: Právì jste za pozicí konce ResultSetu. Zde nemù¾ete volat deleteRow().s

source: There are no rows in this ResultSet.
cs: ®ádný øádek v ResultSet.

source: Not on the insert row.
cs: Ne na vkládaném øádku.

source: You must specify at least one column value to insert a row.
cs: Musíte vyplnit alespoò jeden sloupec pro vlo¾ení øádku.

source: The JVM claims not to support the encoding: {0}
cs: JVM tvrdí, ¾e nepodporuje kodování: {0}

source: Provided InputStream failed.
cs: Selhal poskytnutý InputStream.

source: Provided Reader failed.
cs: Selhal poskytnutý Reader.

source: Can''t refresh the insert row.
cs: Nemohu obnovit vkládaný øádek.

source: Cannot call updateRow() when on the insert row.
cs: Nemohu volat updateRow() na vlkádaném øádku.

source: ResultSets with concurrency CONCUR_READ_ONLY cannot be updated.
cs: ResultSets se soubì¾ností CONCUR_READ_ONLY nemù¾e být aktualizováno

source: No primary key found for table {0}.
cs: Nenalezen primární klíè pro tabulku {0}.

source: Fetch size must be a value greater to or equal to 0.
cs: Nabraná velikost musí být nezáporná.

source: Invalid character data was found. This is most likely caused by stored data containing characters that are invalid for the character set the database was created in. The most common example of this is storing 8bit data in a SQL_ASCII database.
cs: Nalezena vada ve znakových datech. Toto mù¾e být zpùsobeno ulo¾enými daty obsahujícími znaky, které jsou závadné pro znakovou sadu nastavenou pøi zakládání databáze. Nejznámej¹í pøíklad je ukládání 8bitových dat vSQL_ASCII databázi.

source: Bad value for type {0} : {1}
cs: ©patná hodnota pro typ {0} : {1}

source: The column name {0} was not found in this ResultSet.
cs: Sloupec pojmenovaný {0} nebyl nalezen v ResultSet.

source: ResultSet is not updateable. The query that generated this result set must select only one table, and must select all primary keys from that table. See the JDBC 2.1 API Specification, section 5.6 for more details.
cs: ResultSet není aktualizavatelný. Dotaz musí vybírat pouze z jedné tabulky a musí obsahovat v¹echny primární klíèe tabulky. Koukni do JDBC 2.1 API Specifikace, sekce 5.6 pro více podrobností.

source: This ResultSet is closed.
cs: Tento ResultSet je uzavøený.

source: Multiple ResultSets were returned by the query.
cs: Vícenásobný ResultSet byl vrácen dotazem.

source: A CallableStatement was executed with nothing returned.
cs: CallableStatement byl spu¹tìn, leè nic nebylo vráceno.

source: Maximum number of rows must be a value grater than or equal to 0.
cs: Maximální poèet øádek musí být nezáporné èíslo.

source: Query timeout must be a value greater than or equals to 0.
cs: Èasový limit dotazu musí být nezáporné èíslo.

source: The maximum field size must be a value greater than or equal to 0.
cs: Maximální velikost pole musí být nezáporné èíslo.

source: Unknown Types value.
cs: Neznámá hodnota typu.

source: Invalid stream length {0}.
cs: Vadná délka proudu {0}.

source: The JVM claims not to support the {0} encoding.
cs: JVM tvrdí, ¾e nepodporuje kodování {0}.

source: Unknown type {0}.
cs: Neznámý typ {0}.

source: Cannot cast an instance of {0} to type {1}
cs: Nemohu pøetypovat instanci {0} na typ {1}

source: Unsupported Types value: {0}
cs: Nepodporovaná hodnota typu: {0}

source: Malformed function or procedure escape syntax at offset {0}.
cs: Po¹kozená funkce nebo opu¹tìní procedury na pozici {0}.

source: This statement has been closed.
cs: Pøíkaz byl uzavøen.

source: Too many update results were returned.
cs: Bylo vráceno pøíli¹ mnoho výsledkù aktualizací.

source: Unexpected error writing large object to database.
cs: Neoèekávaná chyba pøi zapisování velkého objektu do databáze.

source: {0} function takes one and only one argument.
cs: Funkce {0} bere jeden argument.

source: {0} function takes two and only two arguments.
cs: Funkce {0} bere právì dva argumenty.

source: rand function only takes zero or one argument(the seed).
cs: Funkce rand bere ¾ádný nebo jen jeden argument(seed).

source: {0} function takes four and only four argument.
cs: Funkce {0} bere pøesnì ètyøi argumenty.

source: {0} function takes two or three arguments.
cs: Funkce {0} bere dva nebo tøi argumenty.

source: {0} function doesn''t take any argument.
cs: Funkce {0} nebere ¾ádný argument.

source: Infinite value found for timestamp/date. This cannot be represented as time.
cs: Nekoneèná hodnota pro timestamp/date. Toto nemù¾e reprezentovat èas.

source: The class {0} does not implement org.postgresql.util.PGobject.
cs: Tøída {0} nepodporuje org.postgresql.util.PGobject.

source: Server versions prior to 8.0 do not support savepoints.
cs: Verze serveru ni¾¹í ne¾ 8.0 nepodporují savepoints.

source: Cannot establish a savepoint in auto-commit mode.
cs: Nemohu vytvoøit savepoint v auto-commit modu.

source: Returning autogenerated keys is not supported.
cs: Vrácení automaticky generovaných klíèù není podporováno.

source: The parameter index is out of range: {0}, number of parameters: {1}.
cs: Index parametru mimo rozsah: {0}, poèet parametrù {1}.

source: Cannot reference a savepoint after it has been released.
cs: Nemohu získat odkaz na savepoint, kdy¾ byl uvolnìn.

source: Cannot retrieve the id of a named savepoint.
cs: Nemohu získat id nepojmenovaného savepointu.

source: Cannot retrieve the name of an unnamed savepoint.
cs: Nemohu získat název nepojmenovaného savepointu.

source: Failed to initialize LargeObject API
cs: Selhala inicializace LargeObject API

source: Large Objects may not be used in auto-commit mode.
cs: Velké objecky nemohou být pou¾ity v auto-commit modu.

source: The SSLSocketFactory class provided {0} could not be instantiated.
cs: Tøída SSLSocketFactory poskytla {0} co¾ nemù¾e být instancionizováno.

source: Conversion of money failed.
cs: Pøevod penìz selhal.

source: Exception: {0}
cs: Vyjímka: {0}

source: Stack Trace:
cs: Výpis zásobníku:

source: End of Stack Trace
cs: Konec výpisu zásobníku

source: Exception generating stacktrace for: {0} encountered: {1}
cs: Vyjímka tvoøící výpis zásobníku pro: {0} encountered: {1}

source: Hint: {0}
cs: Rada: {0}

source: Position: {0}
cs: Pozice: {0}

source: Where: {0}
cs: Kde: {0}

source: Location: File: {0}, Routine: {1}, Line: {2}
cs: Poloha: Soubor: {0}, Rutina: {1}, Øádek: {2}
